read_verilog cpu.v alu32.v
synth_xilinx -top cpu
write_verilog cpu_synth.v

